// Модуль 1. Заняття 2. Розгалуження. Цикли

// Завдання 1
// Напиши скрипт перевірки кількості товарів на складі. Є змінні total (кількість товарів на складі) і ordered (одиниць товару в замовленні).

// Порівняй ці значення і за результатами виведи:

// Якщо в замовленні вказано число, що перевищує кількість товарів на складі, то виведи повідомлення "На складі недостатньо товарів!".
// В іншому випадку виводь повідомлення "Замовлення оформлено, з вами зв'яжеться менеджер".
// Перевір працездатність коду з різними значеннями змінної ordered, наприклад 20, 80 і 130.

// const total = 100;
// const ordered = 50;

// if (ordered > total) {
//   console.log("На складі недостатньо товарів!");
// } else {
//   console.log("Замовлення оформлено, з вами зв'яжеться менеджер");
// }

// ordered > total
//   ? console.log("На складі недостатньо товарів!")
//   : console.log("Замовлення оформлено, з вами зв'яжеться менеджер");

//   Завдання 2
// Напиши скрипт, який імітує авторизацію адміністратора в панелі управління.

// Є змінна message в яку буде записано повідомлення про результат. При завантаженні сторінки у відвідувача запитується пароль через prompt:

// Якщо відвідувач вводить "ADMIN", то prompt запитує пароль
// Якщо нічого не введено або натиснуто клавішу Esc - вивести рядок "Скасовано"
// В іншому випадку вивести рядок "Я вас не знаю"
// Пароль перевіряти так:

// Якщо введено пароль "jqueryismyjam", то вивести рядок "Здрастуйте!"
// Інакше виводити рядок "Невірний пароль"

// const ADMIN_LOGIN = "ADMIN";
// const ADMIN_PASSWORD = "jqueryismyjam";
// let message;

// const login = prompt("Enter your login");

// if (login === "ADMIN") {
//   const pass = prompt("Enter your password");

//   if (pass === "jqueryismyjam") {
//     message = "Здрастуйте!";
//   } else {
//     message = "Невірний пароль";
//   }
// } else if (login === "") {
//   message = "Скасовано";
// } else if (login === null) {
//   message = "Esc";
// } else {
//   message = "Я вас не знаю";
// }

// console.log(message);

// Завдання 3
// На рахунку користувача є 23580 кредитів, значення зберігається в змінній credits (створи і привласни). Користувач вирішує купити ремонтних дроїд, які коштують по 3000 кредитів за штуку. Ціна одного дроїда зберігається в змінній pricePerDroid (створи і привласни).

// При відвідуванні сторінки, використовуючи prompt, необхідно запитати кількість дроїдів, які користувач хоче купити і зберегти в змінну.

// Напиши скрипт який:

// Якщо в prompt була натиснута кнопка Cancel, виводить в консоль повідомлення 'Скасовано користувачем!'.
// В іншому випадку, розраховує загальну ціну замовлення і зберігає в змінній totalPrice.
// Перевіряє чи зможе користувач оплатити замовлення:
// якщо сума до оплати перевищує кількість кредитів на рахунку, виводь в консоль повідомлення 'Недостатньо коштів на рахунку!'.
// в іншому випадку необхідно порахувати залишок кредитів на рахунку і вивести повідомлення 'Ви купили [число] дроїдів, на рахунку залишилося [число] кредитів.'.

// const credits = 23580;
// const pricePerDroid = 3000;

// const quantity = prompt("How many drons do you want?");

// if (quantity === null) {
//   console.log("Скасовано користувачем!");
// } else {
//   const totalPrice = quantity * pricePerDroid;

//   if (totalPrice > credits) {
//     console.log("Недостатньо коштів на рахунку!");
//   } else {
//     let rest = credits - totalPrice;
//     let message = `Ви купили ${quantity} дроїдів, на рахунку залишилося ${rest} кредитів.`;
//     console.log(message);
//   }
// }

// Завдання 4
// Користувач може оформити доставку товару до себе в країну, вказавши її при відвідуванні сторінки в prompt. Врахуй, користувач може ввести ім'я країни не тільки буквами нижнього регістра, а наприклад 'кИтАЙ'.

// Напиши скрипт який виводить повідомлення про вартість доставки в зазначену країну. Обов'язково використовуй switch. Формат повідомлення: 'Доставка в [країна] буде коштувати [ціна] кредитів'.

// Але доставка є не скрізь, якщо зазначеної країни немає в списку, то виводь в alert повідомлення 'У вашій країні доставка недоступна'.

// Нижче наведено список країн і вартість доставки.

// Китай - 100 кредитів
// Чилі - 250 кредитів
// Австралія - 170 кредитів
// Індія - 80 кредитів
// Ямайка - 120 кредитів
